erpdev.СХК_Расширение/src/DataProcessors/СХК_МобильныйСкладСырье/СХК_МобильныйСкладСырье.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>СХК_МобильныйСкладСырье</name>
  <attributes>
    <name>Склад</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокГодности</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ТабПриемка</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>ШтихКод</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоСобрано</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

erpdev.СХК_Расширение/src/InformationRegisters/ШтрихкодыНоменклатуры/ШтрихкодыНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="fe779ac1-0e7f-489c-ad06-bec9af582428">
  <name>ШтрихкодыНоменклатуры</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources extendedConfigurationObject="d561ee5a-2a87-4205-93af-4902b1247d87">
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="c79450ab-f8f1-43d9-948d-10c6481c5538">
    <name>Упаковка</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="93716140-4123-4913-8258-75356dec29a0">
    <name>Характеристика</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions extendedConfigurationObject="75e2d606-c8d4-4cfe-8f96-2eaa5c364409">
    <name>Штрихкод</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
</mdclass:InformationRegister>

erpdev.СХК_Расширение/src/Enums/СпособыДоставки/СпособыДоставки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>СпособыДоставки</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>СиламиПеревозчикаПоАдресу</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ДоКлиента</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>Самовывоз</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>СиламиПеревозчика</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>КПолучателюОпределяетСлужбаДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>СиламиПоставщикаДоНашегоСклада</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>НашимиСиламиСАдресаОтправителя</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>СиламиПеревозчикаДоПунктаПередачи</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>СиламиПеревозчикаДоНашегоСклада</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ОтОтправителяОпределяетСлужбаДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

erpdev.СХК_Расширение/src/Documents/ЗаказНаПеремещение/ЗаказНаПеремещение.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="a0254d97-793a-47e1-8640-7712761e87f0">
  <name>ЗаказНаПеремещение</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="2e5dd6c3-73c3-40ec-8b0d-c965441580ad">
    <name>Назначение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e7173c73-2661-4531-b527-d9ab16221f1b">
    <name>ДокументОснование</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="8510f494-1391-4b32-b70c-8b3b9cd19069">
    <name>СкладПолучатель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="7b4da320-9332-4032-9c16-a05fabf9e623">
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="1cfd08e2-e873-414e-95c5-a40c01997cea">
      <name>Назначение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

erpdev.СХК_Расширение/src/Documents/РасходныйОрдерНаТовары/РасходныйОрдерНаТовары.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="e5b57481-c7d7-459c-8f38-003976928dcf">
  <name>РасходныйОрдерНаТовары</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="08a6fc5b-ac14-420f-987d-169c39288bf4">
    <name>ЗаданиеНаПеревозку</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="b4c013e1-f51f-4900-840f-f755e500fa76">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="07d94e4d-722d-4939-a3da-ba2a3afba256">
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="145a504e-53c5-4349-a710-b106ea052174">
    <name>Получатель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="89cd1a11-c961-49a0-b7ea-67cc67387e68">
    <name>СкладскаяОперация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="63f1d0df-8450-40b2-a6bf-26e9a9bc348d">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="00a21d2c-dfa9-40aa-938f-3fe890533f41">
    <name>ПорядокДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="96ee5655-e55c-4d9d-9386-a82e47bcd733">
    <name>ДатаОтгрузки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="5fb4b5c4-30c2-4b89-82ff-7057477218df">
    <name>Помещение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="1e82bc85-5efe-473f-a2a6-04b053896ef5">
    <name>ЗонаОтгрузки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="6a9f8399-4614-4cb5-ba80-210c90c11e54">
    <name>Приоритет</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="49f3e5fd-cf9c-4585-8222-c47ae930e2dd">
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="5d8985e0-1a5e-4908-ba86-c4b692cd1634">
    <name>Контролер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="47e1733e-b075-4282-944c-d07d96cd86a9">
    <name>ВсегоМест</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="8ee7ff7a-ec43-4840-800d-22245c14dc90">
    <name>РежимПросмотраПоТоварам</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <tabularSections extendedConfigurationObject="f93cbc89-602b-4c37-a90c-1bceda80afe7">
    <name>ТоварыПоРаспоряжениям</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="07df2cb8-3a48-4671-b17f-d2bf82e412f8">
      <name>Распоряжение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="83f29f84-a577-47ce-933a-46184309914f">
      <name>Назначение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СХК_НомерПалета</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes extendedConfigurationObject="83b872e0-168f-4cbc-b791-68c2edf79de4">
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="cd7cf0b2-0078-4dfa-b137-5418e69d7024">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="8e2e117e-50d4-46cf-9e08-ea6f475d1cca">
      <name>Серия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="ae04c7e3-73f4-4a07-bef6-baf69fcb4dfc">
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="389dae2c-5f04-4c10-8555-7103bd0c3f21">
    <name>ОтгружаемыеТовары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="0185ac19-4e81-475e-842b-4f1cec88f0d3">
      <name>Назначение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="323f8573-378e-4fef-931a-b93c2c113890">
      <name>УпаковочныйЛистРодитель</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="c4e6782d-54b8-4614-8549-b94f2af33d1b">
      <name>Действие</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="26cd1a83-599c-4cb2-88f4-8da57cd2dfaf">
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="152a5a3e-8c56-4983-9052-b8b75a6e0d12">
      <name>КоличествоУпаковок</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="8666ee78-482b-4c09-9baa-791917648dbd">
      <name>Серия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="b9cf586a-fbd5-4e5f-a0f7-df3ef40e11d2">
      <name>Упаковка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="93ae14aa-f407-4566-96ba-2cbba0eadcc2">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="fc35a8ee-3531-4b7e-8222-611bb0bc88ab">
      <name>УпаковочныйЛист</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="40dd6af6-2e66-4e56-b31e-687455807ff2">
      <name>СтатусУказанияСерий</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>2</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Document>

erpdev.СХК_Расширение/src/Documents/ПеремещениеТоваров/ПеремещениеТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="050b09a5-e36c-42b6-b337-cdddd2968bea">
  <name>ПеремещениеТоваров</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="456f6e03-dba8-4ac3-8dbd-4ccc538799ad">
    <name>СторнируемыйДокумент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="25dc034f-cb5e-490d-9f3d-d9f2b59ba018">
    <name>ДокументОснование</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="3159525b-cd00-411c-bd3f-98b839179d20">
    <name>ЗаказНаПеремещение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="ec1f4519-6787-456f-8137-6e0249afc4c8">
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="a4a823dd-9509-448a-9cc1-e0a54decf43c">
      <name>НазначениеОтправителя</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="37a8e607-b3e5-44fd-b88d-414a02fac7c0">
      <name>ЗаказНаПеремещение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="5d576f74-14c9-4566-b4d8-b0c7708b5033">
      <name>Назначение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

erpdev.СХК_Расширение/src/DataProcessors/СХК_МобильныйСкладСырье/Forms/ФормаПеремещения/Module.bsl
&НаКлиенте
Процедура ТоварыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;  
	
	Если Элемент.ТекущиеДанные.КоличествоУпаковокСобрано > 0 И Элемент.ТекущиеДанные.КоличествоУпаковокСобрано <> Элемент.ТекущиеДанные.КоличествоУпаковок Тогда
		ВывестиВопрос(Элемент.ТекущиеДанные);	
	Иначе
		ПараметрыФормыОстатки = Новый Структура;
		ПараметрыФормыОстатки.Вставить("ДокументЗаказПеремещения",ЭтотОбъект.ДокументЗаказПеремещения);
		СтруктураСтрока = Новый Структура("Номенклатура,Упаковка,КоличествоУпаковок,КоличествоУпаковокСобрано,СерииНоменклатуры");
		ЗаполнитьЗначенияСвойств(СтруктураСтрока, Элемент.ТекущиеДанные);	 
		ПараметрыФормыОстатки.Вставить("СтрокаДокументЗаказПеремещения",СтруктураСтрока);
		АдресПередаваемыхПараметров = ПоместитьВоВременноеХранилище(ПараметрыФормыОстатки,Новый УникальныйИдентификатор);
		_Параметры = новый Структура("Адрес", АдресПередаваемыхПараметров);
		//@skip-check notify-description-to-server-procedure
		ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьЗакрытиеФормыЗаказПоставщика", ЭтаФорма);
		ОткрытьФорму("Обработка.СХК_МобильныйСкладСырье.Форма.ФормаСборкиПеремещения", _Параметры,ЭтаФорма, , , , ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте 
Процедура ВывестиВопрос(Данные)
	
	//@skip-check undefined-function
	Ответ = Вопрос("Добавить позицию?",
	РежимДиалогаВопрос.ДаНет,
	0, // таймаут в секундах
	КодВозвратаДиалога.Да, // (необ.) кнопка по умолчанию
	"Добавить позицию?" // (необ.) заголовок
	//"По данному ордеру все собрано !!!"
	);
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		ПараметрыФормыОстатки = Новый Структура;
		ПараметрыФормыОстатки.Вставить("ДокументЗаказПеремещения",ЭтотОбъект.ДокументЗаказПеремещения);
		СтруктураСтрока = Новый Структура("Номенклатура,Упаковка,КоличествоУпаковок,КоличествоУпаковокСобрано,СерииНоменклатуры");
		ЗаполнитьЗначенияСвойств(СтруктураСтрока, Данные);
		СтруктураСтрока.Вставить("СерииНоменклатуры","");
		СтруктураСтрока.Вставить("КоличествоУпаковокСобрано",0);
		ПараметрыФормыОстатки.Вставить("СтрокаДокументЗаказПеремещения",СтруктураСтрока);
		АдресПередаваемыхПараметров = ПоместитьВоВременноеХранилище(ПараметрыФормыОстатки,Новый УникальныйИдентификатор);
		_Параметры = новый Структура("Адрес", АдресПередаваемыхПараметров);
		//@skip-check notify-description-to-server-procedure
		ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьЗакрытиеФормыЗаказПоставщика", ЭтаФорма);
		ОткрытьФорму("Обработка.СХК_МобильныйСкладСырье.Форма.ФормаСборкиПеремещения", _Параметры,ЭтаФорма, , , , ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс); 
	ИначеЕсли Ответ = КодВозвратаДиалога.Нет Тогда 
		ОтветРедактирования = Вопрос("Изменить позицию?",
		РежимДиалогаВопрос.ДаНет,
		0, // таймаут в секундах
		КодВозвратаДиалога.Да, // (необ.) кнопка по умолчанию
		"Изменить позицию?" // (необ.) заголовок
		//"По данному ордеру все собрано !!!"
		);
		Если ОтветРедактирования = КодВозвратаДиалога.Да Тогда
			ПараметрыФормыОстатки = Новый Структура;
			ПараметрыФормыОстатки.Вставить("ДокументЗаказПеремещения",ЭтотОбъект.ДокументЗаказПеремещения);
			СтруктураСтрока = Новый Структура("Номенклатура,Упаковка,КоличествоУпаковок,КоличествоУпаковокСобрано,СерииНоменклатуры");
			ЗаполнитьЗначенияСвойств(СтруктураСтрока, Данные );	 
			ПараметрыФормыОстатки.Вставить("СтрокаДокументЗаказПеремещения",СтруктураСтрока);
			АдресПередаваемыхПараметров = ПоместитьВоВременноеХранилище(ПараметрыФормыОстатки,Новый УникальныйИдентификатор);
			_Параметры = новый Структура("Адрес", АдресПередаваемыхПараметров);
			//@skip-check notify-description-to-server-procedure
			ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьЗакрытиеФормыЗаказПоставщика", ЭтаФорма);
			ОткрытьФорму("Обработка.СХК_МобильныйСкладСырье.Форма.ФормаСборкиПеремещения", _Параметры,ЭтаФорма, , , , ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
		КонецЕсли;
		
	КонецЕсли;
	
	
КонецПроцедуры


&НаКлиенте
Процедура ОбработатьЗакрытиеФормыЗаказПоставщика(Значение, ДопПараметры) Экспорт
	ЗаполнитьТабЧасть()	
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	СтруктураПараметров = ПолучитьИзВременногоХранилища(Параметры.Адрес);

	Если СтруктураПараметров.ДокументЗаказПеремещения <> "" Тогда
		ЭтотОбъект.ДокументЗаказПеремещения = СтруктураПараметров.ДокументЗаказПеремещения;
		ЗаполнитьТабЧасть();	
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТабЧасть()
	
	Товары.Очистить();
	Товары.Загрузить(ПолучитьДанныеПоЗаказу(ЭтотОбъект.ДокументЗаказПеремещения));

КонецПроцедуры

&НаСервере
Функция ПолучитьДанныеПоЗаказу(Заказ)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
|	ЗаказПоставщикуТовары.Номенклатура КАК Номенклатура,
|	СУММА(ЗаказПоставщикуТовары.КоличествоУпаковок) КАК КоличествоУпаковок,
|	ЗаказПоставщикуТовары.Упаковка КАК Упаковка,
|	ВложенныйЗапрос.Количество КАК КоличествоУпаковокСобрано,
|	ВложенныйЗапрос.Серия КАК СерииНоменклатуры,
|	ВложенныйЗапрос.Ссылка КАК Ссылка
|ИЗ
|	Документ.ЗаказНаПеремещение.Товары КАК ЗаказПоставщикуТовары
|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
|			РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Номенклатура КАК Номенклатура,
|			РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Количество КАК Количество,
|			РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Распоряжение КАК Распоряжение,
|			РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Серия КАК Серия,
|			РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка КАК Ссылка
|		ИЗ
|			Документ.РасходныйОрдерНаТовары.ТоварыПоРаспоряжениям КАК РасходныйОрдерНаТоварыТоварыПоРаспоряжениям
|		ГДЕ
|			РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка.Проведен = ИСТИНА
|			И РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка.ПометкаУдаления = ЛОЖЬ) КАК ВложенныйЗапрос
|		ПО (ЗаказПоставщикуТовары.Ссылка = ВложенныйЗапрос.Распоряжение)
|			И (ЗаказПоставщикуТовары.Номенклатура = ВложенныйЗапрос.Номенклатура)
|ГДЕ
|	ЗаказПоставщикуТовары.Ссылка = &Ссылка
|
|СГРУППИРОВАТЬ ПО
|	ЗаказПоставщикуТовары.Номенклатура,
|	ВложенныйЗапрос.Серия,
|	ВложенныйЗапрос.Ссылка,
|	ЗаказПоставщикуТовары.Упаковка,
|	ВложенныйЗапрос.Количество";
	Запрос.УстановитьПараметр("Ссылка",Заказ );
	Возврат Запрос.Выполнить().Выгрузить();	
КонецФункции

&НаКлиенте
Процедура Переместить(Команда)
	
	О = ПереместитьПоЗаказу();
	Если О = Ложь Тогда
		ЭтаФорма.Закрыть(); 
	Иначе
		
	КонецЕсли;

КонецПроцедуры   

&НаСервере
Функция ПереместитьПоЗаказу() 
	
	Ош = Ложь;

		/////////////// ПеремещениеТоваров 
	СтруктураП = Новый Структура;
	СтруктураП.Вставить("ЗаполнятьПоОрдеру",Истина);
	СтруктураП.Вставить("Статус",Перечисления.СтатусыПеремещенийТоваров.Принято);
	СтруктураП.Вставить("Дата",ТекущаяДата());
	СтруктураП.Вставить("ИмяДокумента","ПеремещениеТоваров");
	СтруктураП.Вставить("ИмяПоляЗаказ","ЗаказНаПеремещение");
	СтруктураП.Вставить("ИмяРегистраЗаказ","ЗаказыНаПеремещение");
	СтруктураП.Вставить("КлючевыеПоля","Номенклатура, Характеристика, Серия, Назначение, НазначениеОтправителя"); 
	МассивЗаказов = Новый Массив;
	МассивЗаказов.Добавить(ДокументЗаказПеремещения.Ссылка);
	СтруктураП.Вставить("МассивЗаказов",МассивЗаказов);
	
	РеквизитыШапки = Новый Структура; 
	РеквизитыШапки.Вставить("ВариантПриемкиТоваров",Перечисления.ВариантыПриемкиТоваров.РазделенаПоЗаказамИНакладным);
	РеквизитыШапки.Вставить("Организация",ДокументЗаказПеремещения.Организация);
	РеквизитыШапки.Вставить("СкладОтправитель",ДокументЗаказПеремещения.СкладОтправитель);
	РеквизитыШапки.Вставить("СкладПолучатель",ДокументЗаказПеремещения.СкладПолучатель);//Справочники.Склады.НайтиПоНаименованию("ГП Склад готовой продукции"));
	РеквизитыШапки.Вставить("СпособДоставки",Перечисления.СпособыДоставки.СиламиПеревозчикаДоНашегоСклада);
	РеквизитыШапки.Вставить("ХозяйственнаяОперация",Перечисления.ХозяйственныеОперации.ПеремещениеТоваров);
	
	СтруктураП.Вставить("РеквизитыШапки",РеквизитыШапки);
	ДокП = Документы.ПеремещениеТоваров.СоздатьДокумент();
	ДокП.Заполнить(СтруктураП);
	ДокП.Дата = ТекущаяДата();
	ДокП.Записать(РежимЗаписиДокумента.Запись);
	
	ДокПТ = ДокП.Ссылка.ПолучитьОбъект();
	ДокПТ.Статус = Перечисления.СтатусыПеремещенийТоваров.Принято; 
	
	Попытка 
		ДокПТ.Записать(РежимЗаписиДокумента.Проведение);
	Исключение  
		ДокПТ.Записать(РежимЗаписиДокумента.Запись);
		Ош = Истина;
	КонецПопытки; 
	
		 Возврат Ош;
КонецФункции

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЭтаФорма.Элементы.СканШК.РедактированиеТекста = Истина;
	АктивироватьПолеСканШК();
	
КонецПроцедуры

&НаКлиенте
Процедура АктивироватьПолеСканШК() 
	ОчиститьПолеНомерУПД(); 
	Элементы.СканШК.ОбновитьТекстРедактирования();
	Элементы.СканШК.Видимость = Ложь;
	Элементы.СканШК.Видимость = Истина;
	ЭтаФорма.ТекущийЭлемент = Элементы.СканШК; 
	# Если МобильныйКлиент Тогда
		НачатьРедактированиеЭлемента();
	#КонецЕсли
	
КонецПроцедуры 

&НаСервере
Процедура ОчиститьПолеНомерУПД()
	СканШК = "";
КонецПроцедуры


&НаКлиенте
Процедура СканШКИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	СтрокаНоменклатуры = НайтиноменклатуруПоШК(Текст);
	Если ТипЗнч(СтрокаНоменклатуры) = Тип("Структура")  Тогда
		ПараметрыФормыОстатки = Новый Структура;
		ПараметрыФормыОстатки.Вставить("ДокументЗаказПеремещения",ЭтотОбъект.ДокументЗаказПеремещения);
		ПараметрыФормыОстатки.Вставить("СтрокаДокументЗаказПеремещения",СтрокаНоменклатуры );
		АдресПередаваемыхПараметров = ПоместитьВоВременноеХранилище(ПараметрыФормыОстатки,Новый УникальныйИдентификатор);
		_Параметры = новый Структура("Адрес", АдресПередаваемыхПараметров);
		//@skip-check notify-description-to-server-procedure
		ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьЗакрытиеФормыЗаказПоставщика", ЭтаФорма);
		ОткрытьФорму("Обработка.СХК_МобильныйСкладСырье.Форма.ФормаСборкиПеремещения", _Параметры,ЭтаФорма, , , , ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
		
	КонецЕсли;	
КонецПроцедуры  

&НаСервере
Функция НайтиноменклатуруПоШК(ШК)
	Ош = Ложь;
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ШтрихкодыНоменклатуры.Номенклатура КАК Номенклатура
	               |ИЗ
	               |	РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
	               |ГДЕ
	               |	ШтрихкодыНоменклатуры.Штрихкод = &Штрихкод"; 
	Запрос.УстановитьПараметр("Штрихкод",ШК);
	Рез = Запрос.Выполнить().Выбрать(); 
	
	Если Рез.Следующий() Тогда  
		Отбор = Новый Структура;
		Отбор.Вставить("Номенклатура",Рез.Номенклатура);
		Отбор.Вставить("КоличествоУпаковокСобрано",0);
		Строки = Товары.НайтиСтроки(Отбор);
		Если Строки.Количество() = 1 Тогда
			СтруктураСтрока = Новый Структура("Номенклатура,Упаковка,КоличествоУпаковок,КоличествоУпаковокСобрано,СерииНоменклатуры");
			ЗаполнитьЗначенияСвойств(СтруктураСтрока, Строки[0]);
			Возврат СтруктураСтрока;
		КонецЕсли;
		КонецЕсли;
	
	Возврат Ош;
	
КонецФункции
